{"format": "graph-model", "generatedBy": "2.17.0", "convertedBy": "TensorFlow.js Converter v4.20.0", "signature": {"inputs": {"keras_tensor_25": {"name": "keras_tensor_25:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "938"}, {"size": "1"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "3"}]}}}}, "modelTopology": {"node": [{"name": "unknown", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "ConstantFolding/StatefulPartitionedCall/functional_5_1/normalization_5_1/truediv_recip", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_5_1/conv1d_5_1/convolution/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_5_1/conv1d_5_1/convolution/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "3"}, {"size": "1"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_5_1/conv1d_5_1/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_5_1/flatten_5_1/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_5_1/dense_5_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "30016"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_5_1/dense_5_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "keras_tensor_25", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "938"}, {"size": "1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_5_1/normalization_5_1/Sub", "op": "Sub", "input": ["keras_tensor_25", "unknown"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_5_1/normalization_5_1/truediv", "op": "Mul", "input": ["StatefulPartitionedCall/functional_5_1/normalization_5_1/Sub", "ConstantFolding/StatefulPartitionedCall/functional_5_1/normalization_5_1/truediv_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_5_1/conv1d_5_1/convolution/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/functional_5_1/normalization_5_1/truediv", "StatefulPartitionedCall/functional_5_1/conv1d_5_1/convolution/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_5_1/conv1d_5_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/functional_5_1/conv1d_5_1/convolution/ExpandDims", "StatefulPartitionedCall/functional_5_1/conv1d_5_1/convolution/ExpandDims_1"], "device": "/device:CPU:0", "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_5_1/conv1d_5_1/convolution/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/functional_5_1/conv1d_5_1/convolution"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["-3"]}}}}, {"name": "StatefulPartitionedCall/functional_5_1/conv1d_5_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_5_1/conv1d_5_1/convolution/Squeeze", "StatefulPartitionedCall/functional_5_1/conv1d_5_1/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_5_1/conv1d_5_1/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/functional_5_1/conv1d_5_1/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_5_1/conv1d_5_1/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_5_1/conv1d_5_1/add", "StatefulPartitionedCall/functional_5_1/conv1d_5_1/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_5_1/flatten_5_1/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/functional_5_1/conv1d_5_1/mul_1", "StatefulPartitionedCall/functional_5_1/flatten_5_1/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_5_1/dense_5_1/Add", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/functional_5_1/flatten_5_1/Reshape", "StatefulPartitionedCall/functional_5_1/dense_5_1/Cast/ReadVariableOp", "StatefulPartitionedCall/functional_5_1/dense_5_1/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_5_1/dense_5_1/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/functional_5_1/dense_5_1/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/functional_5_1/dense_5_1/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1882}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "unknown", "shape": [1, 1, 1], "dtype": "float32"}, {"name": "ConstantFolding/StatefulPartitionedCall/functional_5_1/normalization_5_1/truediv_recip", "shape": [1, 1, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_5_1/conv1d_5_1/convolution/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_5_1/conv1d_5_1/convolution/ExpandDims_1", "shape": [1, 3, 1, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_5_1/conv1d_5_1/Reshape", "shape": [1, 1, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_5_1/flatten_5_1/Reshape/shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/functional_5_1/dense_5_1/Cast/ReadVariableOp", "shape": [30016, 3], "dtype": "float32"}, {"name": "StatefulPartitionedCall/functional_5_1/dense_5_1/Add/ReadVariableOp", "shape": [3], "dtype": "float32"}]}]}